api/controllers/AuthController.php

    public function actionLogin()
    {
        $data = Yii::$app->request->post();
        $email = $data['username'] ?? null; // $email = $data['email'] ?? null;
        $password = $data['password'] ?? null;

        if (!$email || !$password) {
            Yii::$app->response->statusCode = 400;
            return ['success' => false, 'message' => 'Email e senha obrigatórios'];
        }

        $user = User::findOne(['username' => $email]); //$user = User::findOne(['email' => $email]);
---
SELECT * FROM `user` WHERE `username`='admin'